[Imprinted.A_Fortune_Imprinted_Buff H7BaseBuff]
mName="时来运转"
mTooltip="%stat %stat.icon 幸运\n持续 %durnow 回合。"

[Imprinted.A_InstantRecall_Imprinted H7HeroAbility]
mName="瞬间回城"
mTooltip="立即将英雄及其军队传送至最近拥有城镇传送门的友方城镇。"

[A_TimeControl_FromCreature_Buff_Slow_Elite H7BaseBuff]
mName="时间控制 - 减速"
mTooltip="%stat %stat.icon 主动性\n持续 %durnow 回合。"

[Imprinted.A_TimeControl_Imprinted H7HeroAbility]
mTooltipMagicGuild="提升目标友方生物的 %buff1.buff.stat.icon 主动性，并降低目标敌方生物的 %buff2.buff.stat.icon 主动性，持续 %buff1.buff.durini 回合。"
mTooltipUpgraded="影响目标4x4区域内所有生物的 %buff1.buff.stat.icon 主动性：提升友方生物 %buff1.buff.stat.norm 点 %buff1.buff.stat.icon 主动性，并降低敌方生物 %buff2.buff.stat.norm 点 %buff2.buff.stat.icon 主动性，持续 %buff1.buff.durini 回合。"
mName="时间控制"
mTooltip="提升目标友方生物 %buff1.buff.stat.norm 点 %buff1.buff.stat.icon 主动性，或降低目标敌方生物 %buff2.buff.stat.norm 点 %buff2.buff.stat.icon 主动性，持续 %buff1.buff.durini 回合。"

[Imprinted.A_SoulConflagration_Imprinted H7HeroAbility]
mName="心灵烈焰"
mTooltip="目标4x4区域内所有敌方生物受到 %d.min %icon_prime 源力伤害，并且区域内每有一个友方生物堆栈，就额外受到该伤害 %special 的源力伤害。"

[A_SummonElemental_Buff_WeekOfElementals H7BaseBuff]
mName="元素之周"
mTooltip="召唤的堆栈数量增加 %special1。"

[Imprinted.A_Implosion_Imprinted H7HeroAbility]
mName="内向爆裂"
mTooltip="立即造成目标生物堆栈总生命值 %d 的 %d.icon 源力伤害，并将目标周围3格内的所有生物拉向目标。"

[A_InstantReinforcements H7HeroAbility]
mName="火线增援"
mTooltip="立即将选定的生物从最近拥有城镇传送门的友方城镇传送至英雄处。法力消耗基于要传送的生物数量。无法在地表和地下之间使用。"

[Imprinted.A_Implosion_Imprinted_Artifact H7HeroAbility]
mName="内向爆裂"
mTooltip="立即造成目标生物堆栈总生命值 %d 的 %d.icon 源力伤害，并将目标周围3格内的所有生物拉向目标。"

[A_TimeStasis_Buff H7BaseBuff]
mName="时间停滞"
mTooltip="该生物无法行动，并被视作不存在，但 %name 可以被驱散。\n持续到下一战斗回合开始。"

[A_InstantRecall H7HeroAbility]
mName="瞬间回城"
mTooltip="立即将英雄及其军队传送至最近拥有城镇传送门的友方城镇。"

[A_SummonElemental_Buff H7BaseBuff]
mName="召唤元素回声"
mTooltip="如果该生物在下一战斗回合开始时仍然存活，它将获得初始召唤元素数量 %special1 的增援。"

[A_Implosion_Buff H7BaseBuff]
mName="内向爆裂回声"
mTooltip="在下一战斗回合开始时，内向爆裂法术会再次作用于该生物，造成该生物当前总生命值 %d 的 %d.icon 源力伤害。"

[Imprinted.A_DispelMagic_Imprinted H7HeroAbility]
mName="驱魔大法"
mTooltip="立即移除目标生物的所有魔法效果。"

[Imprinted.A_Fortune_Imprinted H7HeroAbility]
mName="时来运转"
mTooltip="提升目标友方生物 %buff.buff.stat.norm 点 %buff.buff.stat.icon 幸运，持续 %buff.buff.durini 回合。"

[A_Teleport_Buff H7BaseBuff]
mName="时光跳跃"
mTooltip="%stat %stat.icon 主动性。\n持续 %durnow 回合。"

[Imprinted.A_TimeControl_Imprinted_Buff_Fast H7BaseBuff]
mName="时间控制 - 加速"
mTooltip="%stat %stat.icon 主动性\n持续 %durnow 回合。"

[Imprinted.A_TimeControl_Imprinted_Buff_Slow H7BaseBuff]
mName="时间控制 - 减速"
mTooltip="%stat %stat.icon 主动性\n持续 %durnow 回合。"

[A_DispelMagic H7HeroAbility]
mTooltipMagicGuild="立即移除目标生物的所有增益和减益效果。"
mTooltipMagicGuildRankLine="%special6 %ICON_MANA 法力消耗"
mTooltipUpgraded="立即移除目标3x3区域内所有生物的魔法效果。"
mName="驱魔大法"
mTooltip="立即移除目标生物的魔法效果。"

[A_RevealTreasure H7HeroAbility]
mName="显示宝物"
mTooltip="如果亚莎之泪隐藏在施法者位置或其1格范围内，则将其显示出来。该法术会消耗英雄剩余的移动力。"

[A_TimeControl_FromCreature_Buff_Slow_Champion H7BaseBuff]
mName="时间控制 - 减速"
mTooltip="%stat %stat.icon 主动性\n持续 %durnow 回合。"

[Imprinted.A_TimeStasis_Imprinted H7HeroAbility]
mName="时间停滞"
mTooltip="目标生物无法行动，并被视作不存在，但 %buff1.buff.name 可以被驱散。\n持续到下一战斗回合开始。"

UCP 1.2

[A_Teleport H7HeroAbility]
mTooltipMagicGuild="立即将目标友方生物传送至一定距离内的空闲位置。"
mTooltipMagicGuildRankLine="距离 %special"
mTooltipUpgraded="立即将目标友方生物传送至 %special 距离内的空闲位置，并提升其 %buff1.buff.stat.icon 主动性 %buff1.buff.stat.norm，持续 %buff1.buff.durini 回合。该生物同时变为免疫状态。"
mName="移形换位"
mTooltip="立即将目标友方生物传送至 %special 距离内的空闲位置。"

[Imprinted.A_Teleport_Imprinted H7HeroAbility]
mName="移形换位"
mTooltip="立即将目标友方生物传送至 %special 距离内的空闲位置。"

UCP 1.3
[Imprinted.A_SummonElemental_Imprinted_Artifact H7HeroAbility]
mName="召唤元素"
mTooltip="立即在目标2x2区域召唤 %special1.val1 个随机元素。"

[Imprinted.A_SummonElemental_Imprinted H7HeroAbility]
mName="召唤元素"
mTooltip="立即在目标2x2区域召唤 %special1.val1 个随机元素。"

v1.31

[A_Implosion H7HeroAbility]
mTooltipMagicGuild="立即造成目标生物总生命值一定百分比的 %d.icon 源力伤害，并将目标周围3格内的所有生物拉向目标。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%d 总生命值"
mTooltipUpgraded="立即造成目标生物总生命值 %d 的 %d.icon 源力伤害，并将目标周围3格内的所有生物拉向目标。该效果在下一战斗回合开始时重复一次，如同以专家等级施放。\n（冷却时间：%buff9.buff.durini 回合）"
mName="内向爆裂"
mTooltip="立即造成目标生物总生命值 %d 的 %d.icon 源力伤害，并将目标周围3格内的所有生物拉向目标。\n（冷却时间：%buff9.buff.durini 回合）"

[A_SummonElemental H7HeroAbility]
mTooltipMagicGuild="立即在战斗地图上召唤随机元素。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%special1.val1 个元素"
mTooltipUpgraded="立即在目标2x2区域召唤 %special1.val1 个随机元素。在下一战斗回合开始时，增加初始召唤元素数量的 %special9。\n（冷却时间：%buff9.buff.durini 回合）"
mName="召唤元素"
mTooltip="立即在目标2x2区域召唤 %special1.val1 个随机元素。\n（冷却时间：%buff9.buff.durini 回合）"

v1.33

[Infection.A_Nova H7HeroAbility]
mTooltipMagicGuild="立即对目标敌方单位造成 %d.icon 源力伤害。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded=""
mName="感染"
mTooltip="立即对目标敌方单位造成 %d.min 到 %d.max %icon_prime 源力伤害，目标生物在 %buff1.buff.durini.norm 回合内从法术和技能中获得的治疗效果降低 %buff1.buff.res1。"

v1.36
 
[reparation.A_Regeneration H7HeroAbility]
mTooltipMagicGuild="立即修理或恢复目标构造体类型的友方生物。"
mTooltipMagicGuildRankLine="%d1.min %d1.icon 生命值"
mTooltipUpgraded="立即修理或恢复目标4x4区域内所有构造体类型的友方生物 %d1.min 点生命值。"
mName="修理"
mTooltip="立即修理或恢复构造体类型的友方生物 %d1.min 点生命值。"

v1.37

[A_TimeStasis H7HeroAbility]
mTooltipMagicGuild="目标生物无法行动，并被视作不存在，但 %buff1.buff.name 可以被驱散。\n持续到下一战斗回合开始。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%special1 %ICON_MANA 法力消耗"
mName="时间停滞"
mTooltip="目标生物无法行动，并被视作不存在，但 %buff1.buff.name 可以被驱散。\n持续到下一战斗回合开始。\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

[A_SoulConflagration H7HeroAbility]
mTooltipMagicGuild="目标4x4区域内所有敌方生物受到源力伤害，并且区域内每有一个友方生物堆栈，就额外受到该伤害一定百分比的源力伤害。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%d.min %icon_prime 源力伤害 和 每个友方生物额外 %special。"
mName="心灵烈焰"
mTooltip="目标4x4区域内所有敌方生物受到 %d.min %icon_prime 源力伤害，并且区域内每有一个友方生物堆栈，就额外受到该伤害 %special 的源力伤害。\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

[Instant_reload.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="移除英雄身上所有生效法术的冷却时间。"
mTooltipMagicGuildRankLine="%special6 %ICON_MANA 法力消耗"
mTooltipUpgraded="移除英雄身上所有生效法术的冷却时间。\n（冷却时间：%buff1.buff.durini 回合）"
mName="瞬间充能"
mTooltip="移除英雄身上所有生效法术的冷却时间。（冷却时间：%buff1.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

v1.38

[A_TimeControl H7HeroAbility]
mTooltipMagicGuild="提升目标友方生物的 %buff1.buff.stat.icon 攻击，并让他在被攻击前先反击；或降低目标敌方生物的 %buff2.buff.stat.icon 防御，并阻止他反击，持续 %buff1.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff1.buff.stat.norm %ICON_ATTACK 攻击 或 %buff2.buff.stat.norm %ICON_DEFENSE 防御"
mTooltipUpgraded="提升目标4x4区域内所有友方生物 %buff1.buff.stat %buff1.buff.stat.icon 攻击，并让他们在被攻击前先反击；同时所有敌方生物获得 %buff2.buff.stat %buff2.buff.stat.icon 防御，阻止他们反击，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"
mName="时间控制"
mTooltip="提升目标友方生物 %buff1.buff.stat.norm 点 %buff1.buff.stat.icon 攻击，并让他在被攻击前先反击；或降低目标敌方生物 %buff2.buff.stat.norm 点 %buff2.buff.stat.icon 防御，阻止他反击，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"

[A_TimeControl_Buff_Slow H7BaseBuff]
mName="时间控制 - 减速"
mTooltip="%stat %stat.icon 防御\n持续 %durnow 回合。"

[A_TimeControl_Buff_Fast H7BaseBuff]
mName="时间控制 - 加速"
mTooltip="%stat %stat.icon 攻击\n持续 %durnow 回合。"

[A_Fortune H7HeroAbility]
mTooltipMagicGuild="提升目标友方生物的 %buff1.buff.stat.icon 幸运，持续 %buff1.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff1.buff.stat %ICON_LUCK 幸运"
mTooltipUpgraded="提升目标4x4区域内所有友方生物 %buff1.buff.stat.norm 点 %buff1.buff.stat.icon 幸运，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"
mName="时来运转"
mTooltip="提升目标友方生物 %buff1.buff.stat.norm 点 %buff1.buff.stat.icon 幸运，持续 %buff1.buff.durini 回合。\n（冷却时间：%buff9.buff.durini 回合）"

[A_Fortune_Buff H7BaseBuff]
mName="时来运转"
mTooltip="%stat %stat.icon 幸运\n持续 %durnow 回合。"